export const POSITION_OPTIONS = [
  'เจ้าพนักงานตรวจสอบบัญชี',
  'เจ้าหน้าที่ระบบงานคอมพิวเตอร์',
  'นักจัดการงานทั่วไป',
  'นักวิชาการตรวจสอบบัญชี',
  'นักวิชาการตรวจสอบบัญชีชำนาญการ',
  'นักวิชาการตรวจสอบบัญชีชำนาญการพิเศษ',
  'นักวิชาการตรวจสอบบัญชีปฏิบัติการ',
  'ผู้เชี่ยวชาญด้านการบัญชีและการสอบบัญชี',
  'ผู้อำนวยการสำนักงานตรวจบัญชีสหกรณ์กระบี่',
  'ผู้อำนวยการสำนักงานตรวจบัญชีสหกรณ์ชุมพร',
  'ผู้อำนวยการสำนักงานตรวจบัญชีสหกรณ์ที่ 8',
  'ผู้อำนวยการสำนักงานตรวจบัญชีสหกรณ์นครศรีธรรมราช',
  'ผู้อำนวยการสำนักงานตรวจบัญชีสหกรณ์พังงา',
  'ผู้อำนวยการสำนักงานตรวจบัญชีสหกรณ์ภูเก็ต',
  'ผู้อำนวยการสำนักงานตรวจบัญชีสหกรณ์ระนอง',
  'ผู้อำนวยการสำนักงานตรวจบัญชีสหกรณ์สุราษฎร์ธานี',
] as const;

export const PERSONNEL_TYPE_OPTIONS = [
  'ข้าราชการ',
  'พนักงานราชการ',
] as const;

export const DIVISION_PROVINCE_OPTIONS = [
  'สำนักงานตรวจบัญชีสหกรณ์ที่ 8',
  'สำนักงานตรวจบัญชีสหกรณ์กระบี่',
  'สำนักงานตรวจบัญชีสหกรณ์ชุมพร',
  'สำนักงานตรวจบัญชีสหกรณ์นครศรีธรรมราช',
  'สำนักงานตรวจบัญชีสหกรณ์พังงา',
  'สำนักงานตรวจบัญชีสหกรณ์ภูเก็ต',
  'สำนักงานตรวจบัญชีสหกรณ์ระนอง',
  'สำนักงานตรวจบัญชีสหกรณ์สุราษฎร์ธานี',
] as const;
